[tasks]
\d+

[options]
mode bmc
depth 50
expect timeout,fail
timeout 600
aigsmt none

[engines]
smtbmc yices

[script]
--pycode-begin--
output("verilog_defines -Dmutidx=%s" % task)
--pycode-end--
read_verilog -sv miter.sv
read_rtlil mutated.il
prep -top miter
fmcombine miter ref uut
flatten
opt -fast

[files]
../../miter.sv
mutated.il
